# GridInGridChainCannotMirror Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridFailures..::..GridInGridChainCannotMirror Property
BuiltInFailures..::..GridFailures Class See Also
---
A grid that is a sub-grid of a multi-segment grid can only be mirrored if the entire multi-segment grid is being mirrored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridInGridChainCannotMirror { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridInGridChainCannotMirror As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridInGridChainCannotMirror {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridFailures Class
Autodesk.Revit.DB Namespace